is1200-example-projects/mcb32tools/headers/proc/p32mz2048ecm124.h
  .extern CNENFINV         /* 0xBF86058C */
  .extern CNSTATF          /* 0xBF860590 */
  .extern CNSTATFCLR       /* 0xBF860594 */
  .extern CNSTATFSET       /* 0xBF860598 */
  .extern CNSTATFINV       /* 0xBF86059C */
  .extern ANSELG           /* 0xBF860600 */
  .extern ANSELGCLR        /* 0xBF860604 */
  .extern ANSELGSET        /* 0xBF860608 */
  .extern ANSELGINV        /* 0xBF86060C */
  .extern TRISG            /* 0xBF860610 */
  .extern TRISGCLR         /* 0xBF860614 */
  .extern TRISGSET         /* 0xBF860618 */
  .extern TRISGINV         /* 0xBF86061C */
  .extern PORTG            /* 0xBF860620 */
  .extern PORTGCLR         /* 0xBF860624 */
  .extern PORTGSET         /* 0xBF860628 */
  .extern PORTGINV         /* 0xBF86062C */
  .extern LATG             /* 0xBF860630 */
  .extern LATGCLR          /* 0xBF860634 */
  .extern LATGSET          /* 0xBF860638 */
  .extern LATGINV          /* 0xBF86063C */
  .extern ODCG             /* 0xBF860640 */
  .extern ODCGCLR          /* 0xBF860644 */
  .extern ODCGSET          /* 0xBF860648 */
  .extern ODCGINV          /* 0xBF86064C */
  .extern CNPUG            /* 0xBF860650 */
  .extern CNPUGCLR         /* 0xBF860654 */
  .extern CNPUGSET         /* 0xBF860658 */
  .extern CNPUGINV         /* 0xBF86065C */
  .extern CNPDG            /* 0xBF860660 */
  .extern CNPDGCLR         /* 0xBF860664 */
  .extern CNPDGSET         /* 0xBF860668 */
  .extern CNPDGINV         /* 0xBF86066C */
  .extern CNCONG           /* 0xBF860670 */
  .extern CNCONGCLR        /* 0xBF860674 */
  .extern CNCONGSET        /* 0xBF860678 */
  .extern CNCONGINV        /* 0xBF86067C */
  .extern CNENG            /* 0xBF860680 */
  .extern CNENGCLR         /* 0xBF860684 */
  .extern CNENGSET         /* 0xBF860688 */
  .extern CNENGINV         /* 0xBF86068C */
  .extern CNSTATG          /* 0xBF860690 */
  .extern CNSTATGCLR       /* 0xBF860694 */
  .extern CNSTATGSET       /* 0xBF860698 */
  .extern CNSTATGINV       /* 0xBF86069C */
  .extern ANSELH           /* 0xBF860700 */
  .extern ANSELHCLR        /* 0xBF860704 */
  .extern ANSELHSET        /* 0xBF860708 */
  .extern ANSELHINV        /* 0xBF86070C */
  .extern TRISH            /* 0xBF860710 */
  .extern TRISHCLR         /* 0xBF860714 */
  .extern TRISHSET         /* 0xBF860718 */
  .extern TRISHINV         /* 0xBF86071C */
  .extern PORTH            /* 0xBF860720 */
  .extern PORTHCLR         /* 0xBF860724 */
  .extern PORTHSET         /* 0xBF860728 */
  .extern PORTHINV         /* 0xBF86072C */
  .extern LATH             /* 0xBF860730 */
  .extern LATHCLR          /* 0xBF860734 */
  .extern LATHSET          /* 0xBF860738 */
  .extern LATHINV          /* 0xBF86073C */
  .extern ODCH             /* 0xBF860740 */
  .extern ODCHCLR          /* 0xBF860744 */
  .extern ODCHSET          /* 0xBF860748 */
  .extern ODCHINV          /* 0xBF86074C */
  .extern CNPUH            /* 0xBF860750 */
  .extern CNPUHCLR         /* 0xBF860754 */
  .extern CNPUHSET         /* 0xBF860758 */
  .extern CNPUHINV         /* 0xBF86075C */
  .extern CNPDH            /* 0xBF860760 */
  .extern CNPDHCLR         /* 0xBF860764 */
  .extern CNPDHSET         /* 0xBF860768 */
  .extern CNPDHINV         /* 0xBF86076C */
  .extern CNCONH           /* 0xBF860770 */
  .extern CNCONHCLR        /* 0xBF860774 */
  .extern CNCONHSET        /* 0xBF860778 */
  .extern CNCONHINV        /* 0xBF86077C */
  .extern CNENH            /* 0xBF860780 */
  .extern CNENHCLR         /* 0xBF860784 */
  .extern CNENHSET         /* 0xBF860788 */
  .extern CNENHINV         /* 0xBF86078C */
  .extern CNSTATH          /* 0xBF860790 */
  .extern CNSTATHCLR       /* 0xBF860794 */
  .extern CNSTATHSET       /* 0xBF860798 */
  .extern CNSTATHINV       /* 0xBF86079C */
  .extern ANSELJ           /* 0xBF860800 */
  .extern ANSELJCLR        /* 0xBF860804 */
  .extern ANSELJSET        /* 0xBF860808 */
  .extern ANSELJINV        /* 0xBF86080C */
  .extern TRISJ            /* 0xBF860810 */
  .extern TRISJCLR         /* 0xBF860814 */
  .extern TRISJSET         /* 0xBF860818 */
  .extern TRISJINV         /* 0xBF86081C */
  .extern PORTJ            /* 0xBF860820 */
  .extern PORTJCLR         /* 0xBF860824 */
  .extern PORTJSET         /* 0xBF860828 */
  .extern PORTJINV         /* 0xBF86082C */
  .extern LATJ             /* 0xBF860830 */
  .extern LATJCLR          /* 0xBF860834 */
  .extern LATJSET          /* 0xBF860838 */
  .extern LATJINV          /* 0xBF86083C */
  .extern ODCJ             /* 0xBF860840 */
  .extern ODCJCLR          /* 0xBF860844 */
  .extern ODCJSET          /* 0xBF860848 */
  .extern ODCJINV          /* 0xBF86084C */
  .extern CNPUJ            /* 0xBF860850 */
  .extern CNPUJCLR         /* 0xBF860854 */
  .extern CNPUJSET         /* 0xBF860858 */
  .extern CNPUJINV         /* 0xBF86085C */
  .extern CNPDJ            /* 0xBF860860 */
  .extern CNPDJCLR         /* 0xBF860864 */
  .extern CNPDJSET         /* 0xBF860868 */
  .extern CNPDJINV         /* 0xBF86086C */
  .extern CNCONJ           /* 0xBF860870 */
  .extern CNCONJCLR        /* 0xBF860874 */
  .extern CNCONJSET        /* 0xBF860878 */
  .extern CNCONJINV        /* 0xBF86087C */
  .extern CNENJ            /* 0xBF860880 */
  .extern CNENJCLR         /* 0xBF860884 */
  .extern CNENJSET         /* 0xBF860888 */
  .extern CNENJINV         /* 0xBF86088C */
  .extern CNSTATJ          /* 0xBF860890 */
  .extern CNSTATJCLR       /* 0xBF860894 */
  .extern CNSTATJSET       /* 0xBF860898 */
  .extern CNSTATJINV       /* 0xBF86089C */
  .extern C1CON            /* 0xBF880000 */
  .extern C1CONCLR         /* 0xBF880004 */
  .extern C1CONSET         /* 0xBF880008 */
  .extern C1CONINV         /* 0xBF88000C */
  .extern C1CFG            /* 0xBF880010 */
  .extern C1CFGCLR         /* 0xBF880014 */
  .extern C1CFGSET         /* 0xBF880018 */
  .extern C1CFGINV         /* 0xBF88001C */
  .extern C1INT            /* 0xBF880020 */
  .extern C1INTCLR         /* 0xBF880024 */
  .extern C1INTSET         /* 0xBF880028 */
  .extern C1INTINV         /* 0xBF88002C */
  .extern C1VEC            /* 0xBF880030 */
  .extern C1VECCLR         /* 0xBF880034 */
  .extern C1VECSET         /* 0xBF880038 */
  .extern C1VECINV         /* 0xBF88003C */
  .extern C1TREC           /* 0xBF880040 */
  .extern C1TRECCLR        /* 0xBF880044 */
  .extern C1TRECSET        /* 0xBF880048 */
  .extern C1TRECINV        /* 0xBF88004C */
  .extern C1FSTAT          /* 0xBF880050 */
  .extern C1FSTATCLR       /* 0xBF880054 */
  .extern C1FSTATSET       /* 0xBF880058 */
  .extern C1FSTATINV       /* 0xBF88005C */
  .extern C1RXOVF          /* 0xBF880060 */
  .extern C1RXOVFCLR       /* 0xBF880064 */
  .extern C1RXOVFSET       /* 0xBF880068 */
  .extern C1RXOVFINV       /* 0xBF88006C */
  .extern C1TMR            /* 0xBF880070 */
  .extern C1TMRCLR         /* 0xBF880074 */
  .extern C1TMRSET         /* 0xBF880078 */
  .extern C1TMRINV         /* 0xBF88007C */
  .extern C1RXM0           /* 0xBF880080 */
  .extern C1RXM0CLR        /* 0xBF880084 */
  .extern C1RXM0SET        /* 0xBF880088 */
  .extern C1RXM0INV        /* 0xBF88008C */
  .extern C1RXM1           /* 0xBF880090 */
  .extern C1RXM1CLR        /* 0xBF880094 */
  .extern C1RXM1SET        /* 0xBF880098 */
  .extern C1RXM1INV        /* 0xBF88009C */
  .extern C1RXM2           /* 0xBF8800A0 */
  .extern C1RXM2CLR        /* 0xBF8800A4 */
  .extern C1RXM2SET        /* 0xBF8800A8 */
  .extern C1RXM2INV        /* 0xBF8800AC */
  .extern C1RXM3           /* 0xBF8800B0 */
  .extern C1RXM3CLR        /* 0xBF8800B4 */
  .extern C1RXM3SET        /* 0xBF8800B8 */
  .extern C1RXM3INV        /* 0xBF8800BC */
  .extern C1FLTCON0        /* 0xBF8800C0 */
  .extern C1FLTCON0CLR     /* 0xBF8800C4 */
  .extern C1FLTCON0SET     /* 0xBF8800C8 */
  .extern C1FLTCON0INV     /* 0xBF8800CC */
  .extern C1FLTCON1        /* 0xBF8800D0 */
  .extern C1FLTCON1CLR     /* 0xBF8800D4 */
  .extern C1FLTCON1SET     /* 0xBF8800D8 */
  .extern C1FLTCON1INV     /* 0xBF8800DC */
  .extern C1FLTCON2        /* 0xBF8800E0 */
  .extern C1FLTCON2CLR     /* 0xBF8800E4 */
  .extern C1FLTCON2SET     /* 0xBF8800E8 */
  .extern C1FLTCON2INV     /* 0xBF8800EC */
  .extern C1FLTCON3        /* 0xBF8800F0 */
  .extern C1FLTCON3CLR     /* 0xBF8800F4 */
  .extern C1FLTCON3SET     /* 0xBF8800F8 */
  .extern C1FLTCON3INV     /* 0xBF8800FC */
  .extern C1FLTCON4        /* 0xBF880100 */
  .extern C1FLTCON4CLR     /* 0xBF880104 */
  .extern C1FLTCON4SET     /* 0xBF880108 */
  .extern C1FLTCON4INV     /* 0xBF88010C */
  .extern C1FLTCON5        /* 0xBF880110 */
  .extern C1FLTCON5CLR     /* 0xBF880114 */
  .extern C1FLTCON5SET     /* 0xBF880118 */
  .extern C1FLTCON5INV     /* 0xBF88011C */
  .extern C1FLTCON6        /* 0xBF880120 */
  .extern C1FLTCON6CLR     /* 0xBF880124 */
  .extern C1FLTCON6SET     /* 0xBF880128 */
  .extern C1FLTCON6INV     /* 0xBF88012C */
  .extern C1FLTCON7        /* 0xBF880130 */
  .extern C1FLTCON7CLR     /* 0xBF880134 */
  .extern C1FLTCON7SET     /* 0xBF880138 */
  .extern C1FLTCON7INV     /* 0xBF88013C */
  .extern C1RXF0           /* 0xBF880140 */
  .extern C1RXF0CLR        /* 0xBF880144 */
  .extern C1RXF0SET        /* 0xBF880148 */
  .extern C1RXF0INV        /* 0xBF88014C */
  .extern C1RXF1           /* 0xBF880150 */
  .extern C1RXF1CLR        /* 0xBF880154 */
  .extern C1RXF1SET        /* 0xBF880158 */
  .extern C1RXF1INV        /* 0xBF88015C */
  .extern C1RXF2           /* 0xBF880160 */
  .extern C1RXF2CLR        /* 0xBF880164 */
  .extern C1RXF2SET        /* 0xBF880168 */
  .extern C1RXF2INV        /* 0xBF88016C */
  .extern C1RXF3           /* 0xBF880170 */
  .extern C1RXF3CLR        /* 0xBF880174 */
  .extern C1RXF3SET        /* 0xBF880178 */
  .extern C1RXF3INV        /* 0xBF88017C */
  .extern C1RXF4           /* 0xBF880180 */
  .extern C1RXF4CLR        /* 0xBF880184 */
  .extern C1RXF4SET        /* 0xBF880188 */
  .extern C1RXF4INV        /* 0xBF88018C */
  .extern C1RXF5           /* 0xBF880190 */
  .extern C1RXF5CLR        /* 0xBF880194 */
  .extern C1RXF5SET        /* 0xBF880198 */
  .extern C1RXF5INV        /* 0xBF88019C */
  .extern C1RXF6           /* 0xBF8801A0 */
  .extern C1RXF6CLR        /* 0xBF8801A4 */
  .extern C1RXF6SET        /* 0xBF8801A8 */
  .extern C1RXF6INV        /* 0xBF8801AC */
  .extern C1RXF7           /* 0xBF8801B0 */
  .extern C1RXF7CLR        /* 0xBF8801B4 */
  .extern C1RXF7SET        /* 0xBF8801B8 */
  .extern C1RXF7INV        /* 0xBF8801BC */
  .extern C1RXF8           /* 0xBF8801C0 */
  .extern C1RXF8CLR        /* 0xBF8801C4 */
  .extern C1RXF8SET        /* 0xBF8801C8 */
  .extern C1RXF8INV        /* 0xBF8801CC */
  .extern C1RXF9           /* 0xBF8801D0 */
  .extern C1RXF9CLR        /* 0xBF8801D4 */
  .extern C1RXF9SET        /* 0xBF8801D8 */
  .extern C1RXF9INV        /* 0xBF8801DC */
  .extern C1RXF10          /* 0xBF8801E0 */
  .extern C1RXF10CLR       /* 0xBF8801E4 */
  .extern C1RXF10SET       /* 0xBF8801E8 */
  .extern C1RXF10INV       /* 0xBF8801EC */
  .extern C1RXF11          /* 0xBF8801F0 */
  .extern C1RXF11CLR       /* 0xBF8801F4 */
  .extern C1RXF11SET       /* 0xBF8801F8 */
  .extern C1RXF11INV       /* 0xBF8801FC */
  .extern C1RXF12          /* 0xBF880200 */
  .extern C1RXF12CLR       /* 0xBF880204 */
  .extern C1RXF12SET       /* 0xBF880208 */
  .extern C1RXF12INV       /* 0xBF88020C */
  .extern C1RXF13          /* 0xBF880210 */
  .extern C1RXF13CLR       /* 0xBF880214 */
  .extern C1RXF13SET       /* 0xBF880218 */
  .extern C1RXF13INV       /* 0xBF88021C */
  .extern C1RXF14          /* 0xBF880220 */
  .extern C1RXF14CLR       /* 0xBF880224 */
  .extern C1RXF14SET       /* 0xBF880228 */
  .extern C1RXF14INV       /* 0xBF88022C */
  .extern C1RXF15          /* 0xBF880230 */
  .extern C1RXF15CLR       /* 0xBF880234 */
  .extern C1RXF15SET       /* 0xBF880238 */
  .extern C1RXF15INV       /* 0xBF88023C */
  .extern C1RXF16          /* 0xBF880240 */
  .extern C1RXF16CLR       /* 0xBF880244 */
  .extern C1RXF16SET       /* 0xBF880248 */
  .extern C1RXF16INV       /* 0xBF88024C */
  .extern C1RXF17          /* 0xBF880250 */
  .extern C1RXF17CLR       /* 0xBF880254 */
  .extern C1RXF17SET       /* 0xBF880258 */
  .extern C1RXF17INV       /* 0xBF88025C */
  .extern C1RXF18          /* 0xBF880260 */
  .extern C1RXF18CLR       /* 0xBF880264 */
  .extern C1RXF18SET       /* 0xBF880268 */
  .extern C1RXF18INV       /* 0xBF88026C */
  .extern C1RXF19          /* 0xBF880270 */
  .extern C1RXF19CLR       /* 0xBF880274 */
  .extern C1RXF19SET       /* 0xBF880278 */
  .extern C1RXF19INV       /* 0xBF88027C */
  .extern C1RXF20          /* 0xBF880280 */
  .extern C1RXF20CLR       /* 0xBF880284 */
  .extern C1RXF20SET       /* 0xBF880288 */
  .extern C1RXF20INV       /* 0xBF88028C */
  .extern C1RXF21          /* 0xBF880290 */
  .extern C1RXF21CLR       /* 0xBF880294 */
  .extern C1RXF21SET       /* 0xBF880298 */
  .extern C1RXF21INV       /* 0xBF88029C */
  .extern C1RXF22          /* 0xBF8802A0 */
  .extern C1RXF22CLR       /* 0xBF8802A4 */
  .extern C1RXF22SET       /* 0xBF8802A8 */
  .extern C1RXF22INV       /* 0xBF8802AC */
  .extern C1RXF23          /* 0xBF8802B0 */
  .extern C1RXF23CLR       /* 0xBF8802B4 */
  .extern C1RXF23SET       /* 0xBF8802B8 */
  .extern C1RXF23INV       /* 0xBF8802BC */
  .extern C1RXF24          /* 0xBF8802C0 */
  .extern C1RXF24CLR       /* 0xBF8802C4 */
  .extern C1RXF24SET       /* 0xBF8802C8 */
  .extern C1RXF24INV       /* 0xBF8802CC */
  .extern C1RXF25          /* 0xBF8802D0 */
  .extern C1RXF25CLR       /* 0xBF8802D4 */
  .extern C1RXF25SET       /* 0xBF8802D8 */
  .extern C1RXF25INV       /* 0xBF8802DC */
  .extern C1RXF26          /* 0xBF8802E0 */
  .extern C1RXF26CLR       /* 0xBF8802E4 */
  .extern C1RXF26SET       /* 0xBF8802E8 */
  .extern C1RXF26INV       /* 0xBF8802EC */
  .extern C1RXF27          /* 0xBF8802F0 */
  .extern C1RXF27CLR       /* 0xBF8802F4 */
  .extern C1RXF27SET       /* 0xBF8802F8 */
  .extern C1RXF27INV       /* 0xBF8802FC */
  .extern C1RXF28          /* 0xBF880300 */
  .extern C1RXF28CLR       /* 0xBF880304 */
  .extern C1RXF28SET       /* 0xBF880308 */
  .extern C1RXF28INV       /* 0xBF88030C */
  .extern C1RXF29          /* 0xBF880310 */
  .extern C1RXF29CLR       /* 0xBF880314 */
  .extern C1RXF29SET       /* 0xBF880318 */
  .extern C1RXF29INV       /* 0xBF88031C */
  .extern C1RXF30          /* 0xBF880320 */
  .extern C1RXF30CLR       /* 0xBF880324 */
  .extern C1RXF30SET       /* 0xBF880328 */
  .extern C1RXF30INV       /* 0xBF88032C */
  .extern C1RXF31          /* 0xBF880330 */
  .extern C1RXF31CLR       /* 0xBF880334 */
  .extern C1RXF31SET       /* 0xBF880338 */
  .extern C1RXF31INV       /* 0xBF88033C */
  .extern C1FIFOBA         /* 0xBF880340 */
  .extern C1FIFOBACLR      /* 0xBF880344 */
  .extern C1FIFOBASET      /* 0xBF880348 */
  .extern C1FIFOBAINV      /* 0xBF88034C */
  .extern C1FIFOCON0       /* 0xBF880350 */
  .extern C1FIFOCON0CLR    /* 0xBF880354 */
  .extern C1FIFOCON0SET    /* 0xBF880358 */
  .extern C1FIFOCON0INV    /* 0xBF88035C */
  .extern C1FIFOINT0       /* 0xBF880360 */
  .extern C1FIFOINT0CLR    /* 0xBF880364 */
  .extern C1FIFOINT0SET    /* 0xBF880368 */
  .extern C1FIFOINT0INV    /* 0xBF88036C */
  .extern C1FIFOUA0        /* 0xBF880370 */
  .extern C1FIFOUA0CLR     /* 0xBF880374 */
  .extern C1FIFOUA0SET     /* 0xBF880378 */
  .extern C1FIFOUA0INV     /* 0xBF88037C */
  .extern C1FIFOCI0        /* 0xBF880380 */
  .extern C1FIFOCI0CLR     /* 0xBF880384 */
  .extern C1FIFOCI0SET     /* 0xBF880388 */
  .extern C1FIFOCI0INV     /* 0xBF88038C */
  .extern C1FIFOCON1       /* 0xBF880390 */
  .extern C1FIFOCON1CLR    /* 0xBF880394 */
  .extern C1FIFOCON1SET    /* 0xBF880398 */
  .extern C1FIFOCON1INV    /* 0xBF88039C */
  .extern C1FIFOINT1       /* 0xBF8803A0 */
  .extern C1FIFOINT1CLR    /* 0xBF8803A4 */
  .extern C1FIFOINT1SET    /* 0xBF8803A8 */
  .extern C1FIFOINT1INV    /* 0xBF8803AC */
  .extern C1FIFOUA1        /* 0xBF8803B0 */
  .extern C1FIFOUA1CLR     /* 0xBF8803B4 */
  .extern C1FIFOUA1SET     /* 0xBF8803B8 */
  .extern C1FIFOUA1INV     /* 0xBF8803BC */
  .extern C1FIFOCI1        /* 0xBF8803C0 */
  .extern C1FIFOCI1CLR     /* 0xBF8803C4 */
  .extern C1FIFOCI1SET     /* 0xBF8803C8 */
  .extern C1FIFOCI1INV     /* 0xBF8803CC */
  .extern C1FIFOCON2       /* 0xBF8803D0 */
  .extern C1FIFOCON2CLR    /* 0xBF8803D4 */
  .extern C1FIFOCON2SET    /* 0xBF8803D8 */
  .extern C1FIFOCON2INV    /* 0xBF8803DC */
  .extern C1FIFOINT2       /* 0xBF8803E0 */
  .extern C1FIFOINT2CLR    /* 0xBF8803E4 */
  .extern C1FIFOINT2SET    /* 0xBF8803E8 */
  .extern C1FIFOINT2INV    /* 0xBF8803EC */
  .extern C1FIFOUA2        /* 0xBF8803F0 */
  .extern C1FIFOUA2CLR     /* 0xBF8803F4 */
  .extern C1FIFOUA2SET     /* 0xBF8803F8 */
  .extern C1FIFOUA2INV     /* 0xBF8803FC */
  .extern C1FIFOCI2        /* 0xBF880400 */
  .extern C1FIFOCI2CLR     /* 0xBF880404 */
  .extern C1FIFOCI2SET     /* 0xBF880408 */
  .extern C1FIFOCI2INV     /* 0xBF88040C */
  .extern C1FIFOCON3       /* 0xBF880410 */
  .extern C1FIFOCON3CLR    /* 0xBF880414 */
  .extern C1FIFOCON3SET    /* 0xBF880418 */
  .extern C1FIFOCON3INV    /* 0xBF88041C */
  .extern C1FIFOINT3       /* 0xBF880420 */
  .extern C1FIFOINT3CLR    /* 0xBF880424 */
  .extern C1FIFOINT3SET    /* 0xBF880428 */
  .extern C1FIFOINT3INV    /* 0xBF88042C */
  .extern C1FIFOUA3        /* 0xBF880430 */
  .extern C1FIFOUA3CLR     /* 0xBF880434 */
  .extern C1FIFOUA3SET     /* 0xBF880438 */
  .extern C1FIFOUA3INV     /* 0xBF88043C */
  .extern C1FIFOCI3        /* 0xBF880440 */
  .extern C1FIFOCI3CLR     /* 0xBF880444 */
  .extern C1FIFOCI3SET     /* 0xBF880448 */
  .extern C1FIFOCI3INV     /* 0xBF88044C */
  .extern C1FIFOCON4       /* 0xBF880450 */
  .extern C1FIFOCON4CLR    /* 0xBF880454 */
  .extern C1FIFOCON4SET    /* 0xBF880458 */
  .extern C1FIFOCON4INV    /* 0xBF88045C */
  .extern C1FIFOINT4       /* 0xBF880460 */
  .extern C1FIFOINT4CLR    /* 0xBF880464 */
  .extern C1FIFOINT4SET    /* 0xBF880468 */
  .extern C1FIFOINT4INV    /* 0xBF88046C */
  .extern C1FIFOUA4        /* 0xBF880470 */
  .extern C1FIFOUA4CLR     /* 0xBF880474 */
  .extern C1FIFOUA4SET     /* 0xBF880478 */
  .extern C1FIFOUA4INV     /* 0xBF88047C */
  .extern C1FIFOCI4        /* 0xBF880480 */
  .extern C1FIFOCI4CLR     /* 0xBF880484 */
  .extern C1FIFOCI4SET     /* 0xBF880488 */
  .extern C1FIFOCI4INV     /* 0xBF88048C */
  .extern C1FIFOCON5       /* 0xBF880490 */
  .extern C1FIFOCON5CLR    /* 0xBF880494 */
  .extern C1FIFOCON5SET    /* 0xBF880498 */
  .extern C1FIFOCON5INV    /* 0xBF88049C */
  .extern C1FIFOINT5       /* 0xBF8804A0 */
  .extern C1FIFOINT5CLR    /* 0xBF8804A4 */
  .extern C1FIFOINT5SET    /* 0xBF8804A8 */
  .extern C1FIFOINT5INV    /* 0xBF8804AC */
  .extern C1FIFOUA5        /* 0xBF8804B0 */
  .extern C1FIFOUA5CLR     /* 0xBF8804B4 */
  .extern C1FIFOUA5SET     /* 0xBF8804B8 */
  .extern C1FIFOUA5INV     /* 0xBF8804BC */
  .extern C1FIFOCI5        /* 0xBF8804C0 */
  .extern C1FIFOCI5CLR     /* 0xBF8804C4 */
  .extern C1FIFOCI5SET     /* 0xBF8804C8 */
  .extern C1FIFOCI5INV     /* 0xBF8804CC */
  .extern C1FIFOCON6       /* 0xBF8804D0 */
  .extern C1FIFOCON6CLR    /* 0xBF8804D4 */
  .extern C1FIFOCON6SET    /* 0xBF8804D8 */
  .extern C1FIFOCON6INV    /* 0xBF8804DC */
  .extern C1FIFOINT6       /* 0xBF8804E0 */
  .extern C1FIFOINT6CLR    /* 0xBF8804E4 */
  .extern C1FIFOINT6SET    /* 0xBF8804E8 */
  .extern C1FIFOINT6INV    /* 0xBF8804EC */
  .extern C1FIFOUA6        /* 0xBF8804F0 */
  .extern C1FIFOUA6CLR     /* 0xBF8804F4 */
  .extern C1FIFOUA6SET     /* 0xBF8804F8 */
  .extern C1FIFOUA6INV     /* 0xBF8804FC */
  .extern C1FIFOCI6        /* 0xBF880500 */
  .extern C1FIFOCI6CLR     /* 0xBF880504 */
  .extern C1FIFOCI6SET     /* 0xBF880508 */
  .extern C1FIFOCI6INV     /* 0xBF88050C */
  .extern C1FIFOCON7       /* 0xBF880510 */
  .extern C1FIFOCON7CLR    /* 0xBF880514 */
  .extern C1FIFOCON7SET    /* 0xBF880518 */
  .extern C1FIFOCON7INV    /* 0xBF88051C */
  .extern C1FIFOINT7       /* 0xBF880520 */
  .extern C1FIFOINT7CLR    /* 0xBF880524 */
  .extern C1FIFOINT7SET    /* 0xBF880528 */
  .extern C1FIFOINT7INV    /* 0xBF88052C */
  .extern C1FIFOUA7        /* 0xBF880530 */
  .extern C1FIFOUA7CLR     /* 0xBF880534 */
  .extern C1FIFOUA7SET     /* 0xBF880538 */
  .extern C1FIFOUA7INV     /* 0xBF88053C */
  .extern C1FIFOCI7        /* 0xBF880540 */
  .extern C1FIFOCI7CLR     /* 0xBF880544 */
  .extern C1FIFOCI7SET     /* 0xBF880548 */
  .extern C1FIFOCI7INV     /* 0xBF88054C */
  .extern C1FIFOCON8       /* 0xBF880550 */
  .extern C1FIFOCON8CLR    /* 0xBF880554 */
  .extern C1FIFOCON8SET    /* 0xBF880558 */
  .extern C1FIFOCON8INV    /* 0xBF88055C */
  .extern C1FIFOINT8       /* 0xBF880560 */
  .extern C1FIFOINT8CLR    /* 0xBF880564 */
  .extern C1FIFOINT8SET    /* 0xBF880568 */
  .extern C1FIFOINT8INV    /* 0xBF88056C */
  .extern C1FIFOUA8        /* 0xBF880570 */
  .extern C1FIFOUA8CLR     /* 0xBF880574 */
  .extern C1FIFOUA8SET     /* 0xBF880578 */
  .extern C1FIFOUA8INV     /* 0xBF88057C */
  .extern C1FIFOCI8        /* 0xBF880580 */
  .extern C1FIFOCI8CLR     /* 0xBF880584 */
  .extern C1FIFOCI8SET     /* 0xBF880588 */
  .extern C1FIFOCI8INV     /* 0xBF88058C */
  .extern C1FIFOCON9       /* 0xBF880590 */
  .extern C1FIFOCON9CLR    /* 0xBF880594 */
  .extern C1FIFOCON9SET    /* 0xBF880598 */
  .extern C1FIFOCON9INV    /* 0xBF88059C */
  .extern C1FIFOINT9       /* 0xBF8805A0 */
  .extern C1FIFOINT9CLR    /* 0xBF8805A4 */
  .extern C1FIFOINT9SET    /* 0xBF8805A8 */
  .extern C1FIFOINT9INV    /* 0xBF8805AC */
  .extern C1FIFOUA9        /* 0xBF8805B0 */
  .extern C1FIFOUA9CLR     /* 0xBF8805B4 */
  .extern C1FIFOUA9SET     /* 0xBF8805B8 */
  .extern C1FIFOUA9INV     /* 0xBF8805BC */
  .extern C1FIFOCI9        /* 0xBF8805C0 */
  .extern C1FIFOCI9CLR     /* 0xBF8805C4 */
  .extern C1FIFOCI9SET     /* 0xBF8805C8 */
  .extern C1FIFOCI9INV     /* 0xBF8805CC */
  .extern C1FIFOCON10      /* 0xBF8805D0 */
  .extern C1FIFOCON10CLR   /* 0xBF8805D4 */
  .extern C1FIFOCON10SET   /* 0xBF8805D8 */
  .extern C1FIFOCON10INV   /* 0xBF8805DC */
  .extern C1FIFOINT10      /* 0xBF8805E0 */
  .extern C1FIFOINT10CLR   /* 0xBF8805E4 */
  .extern C1FIFOINT10SET   /* 0xBF8805E8 */
  .extern C1FIFOINT10INV   /* 0xBF8805EC */
  .extern C1FIFOUA10       /* 0xBF8805F0 */
  .extern C1FIFOUA10CLR    /* 0xBF8805F4 */
  .extern C1FIFOUA10SET    /* 0xBF8805F8 */
  .extern C1FIFOUA10INV    /* 0xBF8805FC */
  .extern C1FIFOCI10       /* 0xBF880600 */
  .extern C1FIFOCI10CLR    /* 0xBF880604 */
  .extern C1FIFOCI10SET    /* 0xBF880608 */
  .extern C1FIFOCI10INV    /* 0xBF88060C */
  .extern C1FIFOCON11      /* 0xBF880610 */
  .extern C1FIFOCON11CLR   /* 0xBF880614 */
  .extern C1FIFOCON11SET   /* 0xBF880618 */
  .extern C1FIFOCON11INV   /* 0xBF88061C */
  .extern C1FIFOINT11      /* 0xBF880620 */
  .extern C1FIFOINT11CLR   /* 0xBF880624 */
  .extern C1FIFOINT11SET   /* 0xBF880628 */
  .extern C1FIFOINT11INV   /* 0xBF88062C */
  .extern C1FIFOUA11       /* 0xBF880630 */
  .extern C1FIFOUA11CLR    /* 0xBF880634 */
  .extern C1FIFOUA11SET    /* 0xBF880638 */
  .extern C1FIFOUA11INV    /* 0xBF88063C */
  .extern C1FIFOCI11       /* 0xBF880640 */
  .extern C1FIFOCI11CLR    /* 0xBF880644 */
  .extern C1FIFOCI11SET    /* 0xBF880648 */
  .extern C1FIFOCI11INV    /* 0xBF88064C */
  .extern C1FIFOCON12      /* 0xBF880650 */
  .extern C1FIFOCON12CLR   /* 0xBF880654 */
  .extern C1FIFOCON12SET   /* 0xBF880658 */
  .extern C1FIFOCON12INV   /* 0xBF88065C */
  .extern C1FIFOINT12      /* 0xBF880660 */
  .extern C1FIFOINT12CLR   /* 0xBF880664 */
  .extern C1FIFOINT12SET   /* 0xBF880668 */
  .extern C1FIFOINT12INV   /* 0xBF88066C */
  .extern C1FIFOUA12       /* 0xBF880670 */
  .extern C1FIFOUA12CLR    /* 0xBF880674 */
  .extern C1FIFOUA12SET    /* 0xBF880678 */
  .extern C1FIFOUA12INV    /* 0xBF88067C */
  .extern C1FIFOCI12       /* 0xBF880680 */
  .extern C1FIFOCI12CLR    /* 0xBF880684 */
  .extern C1FIFOCI12SET    /* 0xBF880688 */
  .extern C1FIFOCI12INV    /* 0xBF88068C */
