is1200-example-projects/mcb32tools/headers/proc/p32mz2048ecm124.h
#define _CNPUH_CNPUH5_POSITION                   0x00000005
#define _CNPUH_CNPUH5_MASK                       0x00000020
#define _CNPUH_CNPUH5_LENGTH                     0x00000001

#define _CNPUH_CNPUH6_POSITION                   0x00000006
#define _CNPUH_CNPUH6_MASK                       0x00000040
#define _CNPUH_CNPUH6_LENGTH                     0x00000001

#define _CNPUH_CNPUH8_POSITION                   0x00000008
#define _CNPUH_CNPUH8_MASK                       0x00000100
#define _CNPUH_CNPUH8_LENGTH                     0x00000001

#define _CNPUH_CNPUH9_POSITION                   0x00000009
#define _CNPUH_CNPUH9_MASK                       0x00000200
#define _CNPUH_CNPUH9_LENGTH                     0x00000001

#define _CNPUH_CNPUH10_POSITION                  0x0000000A
#define _CNPUH_CNPUH10_MASK                      0x00000400
#define _CNPUH_CNPUH10_LENGTH                    0x00000001

#define _CNPUH_CNPUH12_POSITION                  0x0000000C
#define _CNPUH_CNPUH12_MASK                      0x00001000
#define _CNPUH_CNPUH12_LENGTH                    0x00000001

#define _CNPUH_CNPUH13_POSITION                  0x0000000D
#define _CNPUH_CNPUH13_MASK                      0x00002000
#define _CNPUH_CNPUH13_LENGTH                    0x00000001

#define _CNPUH_w_POSITION                        0x00000000
#define _CNPUH_w_MASK                            0xFFFFFFFF
#define _CNPUH_w_LENGTH                          0x00000020

#define _CNPDH_CNPDH0_POSITION                   0x00000000
#define _CNPDH_CNPDH0_MASK                       0x00000001
#define _CNPDH_CNPDH0_LENGTH                     0x00000001

#define _CNPDH_CNPDH1_POSITION                   0x00000001
#define _CNPDH_CNPDH1_MASK                       0x00000002
#define _CNPDH_CNPDH1_LENGTH                     0x00000001

#define _CNPDH_CNPDH4_POSITION                   0x00000004
#define _CNPDH_CNPDH4_MASK                       0x00000010
#define _CNPDH_CNPDH4_LENGTH                     0x00000001

#define _CNPDH_CNPDH5_POSITION                   0x00000005
#define _CNPDH_CNPDH5_MASK                       0x00000020
#define _CNPDH_CNPDH5_LENGTH                     0x00000001

#define _CNPDH_CNPDH6_POSITION                   0x00000006
#define _CNPDH_CNPDH6_MASK                       0x00000040
#define _CNPDH_CNPDH6_LENGTH                     0x00000001

#define _CNPDH_CNPDH8_POSITION                   0x00000008
#define _CNPDH_CNPDH8_MASK                       0x00000100
#define _CNPDH_CNPDH8_LENGTH                     0x00000001

#define _CNPDH_CNPDH9_POSITION                   0x00000009
#define _CNPDH_CNPDH9_MASK                       0x00000200
#define _CNPDH_CNPDH9_LENGTH                     0x00000001

#define _CNPDH_CNPDH10_POSITION                  0x0000000A
#define _CNPDH_CNPDH10_MASK                      0x00000400
#define _CNPDH_CNPDH10_LENGTH                    0x00000001

#define _CNPDH_CNPDH12_POSITION                  0x0000000C
#define _CNPDH_CNPDH12_MASK                      0x00001000
#define _CNPDH_CNPDH12_LENGTH                    0x00000001

#define _CNPDH_CNPDH13_POSITION                  0x0000000D
#define _CNPDH_CNPDH13_MASK                      0x00002000
#define _CNPDH_CNPDH13_LENGTH                    0x00000001

#define _CNPDH_w_POSITION                        0x00000000
#define _CNPDH_w_MASK                            0xFFFFFFFF
#define _CNPDH_w_LENGTH                          0x00000020

#define _CNCONH_SIDL_POSITION                    0x0000000D
#define _CNCONH_SIDL_MASK                        0x00002000
#define _CNCONH_SIDL_LENGTH                      0x00000001

#define _CNCONH_ON_POSITION                      0x0000000F
#define _CNCONH_ON_MASK                          0x00008000
#define _CNCONH_ON_LENGTH                        0x00000001

#define _CNCONH_w_POSITION                       0x00000000
#define _CNCONH_w_MASK                           0xFFFFFFFF
#define _CNCONH_w_LENGTH                         0x00000020

#define _CNENH_CNIEH0_POSITION                   0x00000000
#define _CNENH_CNIEH0_MASK                       0x00000001
#define _CNENH_CNIEH0_LENGTH                     0x00000001

#define _CNENH_CNIEH1_POSITION                   0x00000001
#define _CNENH_CNIEH1_MASK                       0x00000002
#define _CNENH_CNIEH1_LENGTH                     0x00000001

#define _CNENH_CNIEH4_POSITION                   0x00000004
#define _CNENH_CNIEH4_MASK                       0x00000010
#define _CNENH_CNIEH4_LENGTH                     0x00000001

#define _CNENH_CNIEH5_POSITION                   0x00000005
#define _CNENH_CNIEH5_MASK                       0x00000020
#define _CNENH_CNIEH5_LENGTH                     0x00000001

#define _CNENH_CNIEH6_POSITION                   0x00000006
#define _CNENH_CNIEH6_MASK                       0x00000040
#define _CNENH_CNIEH6_LENGTH                     0x00000001

#define _CNENH_CNIEH8_POSITION                   0x00000008
#define _CNENH_CNIEH8_MASK                       0x00000100
#define _CNENH_CNIEH8_LENGTH                     0x00000001

#define _CNENH_CNIEH9_POSITION                   0x00000009
#define _CNENH_CNIEH9_MASK                       0x00000200
#define _CNENH_CNIEH9_LENGTH                     0x00000001

#define _CNENH_CNIEH10_POSITION                  0x0000000A
#define _CNENH_CNIEH10_MASK                      0x00000400
#define _CNENH_CNIEH10_LENGTH                    0x00000001

#define _CNENH_CNIEH12_POSITION                  0x0000000C
#define _CNENH_CNIEH12_MASK                      0x00001000
#define _CNENH_CNIEH12_LENGTH                    0x00000001

#define _CNENH_CNIEH13_POSITION                  0x0000000D
#define _CNENH_CNIEH13_MASK                      0x00002000
#define _CNENH_CNIEH13_LENGTH                    0x00000001

#define _CNENH_w_POSITION                        0x00000000
#define _CNENH_w_MASK                            0xFFFFFFFF
#define _CNENH_w_LENGTH                          0x00000020

#define _CNSTATH_CNSTATH0_POSITION               0x00000000
#define _CNSTATH_CNSTATH0_MASK                   0x00000001
#define _CNSTATH_CNSTATH0_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH1_POSITION               0x00000001
#define _CNSTATH_CNSTATH1_MASK                   0x00000002
#define _CNSTATH_CNSTATH1_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH4_POSITION               0x00000004
#define _CNSTATH_CNSTATH4_MASK                   0x00000010
#define _CNSTATH_CNSTATH4_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH5_POSITION               0x00000005
#define _CNSTATH_CNSTATH5_MASK                   0x00000020
#define _CNSTATH_CNSTATH5_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH6_POSITION               0x00000006
#define _CNSTATH_CNSTATH6_MASK                   0x00000040
#define _CNSTATH_CNSTATH6_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH8_POSITION               0x00000008
#define _CNSTATH_CNSTATH8_MASK                   0x00000100
#define _CNSTATH_CNSTATH8_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH9_POSITION               0x00000009
#define _CNSTATH_CNSTATH9_MASK                   0x00000200
#define _CNSTATH_CNSTATH9_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH10_POSITION              0x0000000A
#define _CNSTATH_CNSTATH10_MASK                  0x00000400
#define _CNSTATH_CNSTATH10_LENGTH                0x00000001

#define _CNSTATH_CNSTATH12_POSITION              0x0000000C
#define _CNSTATH_CNSTATH12_MASK                  0x00001000
#define _CNSTATH_CNSTATH12_LENGTH                0x00000001

#define _CNSTATH_CNSTATH13_POSITION              0x0000000D
#define _CNSTATH_CNSTATH13_MASK                  0x00002000
#define _CNSTATH_CNSTATH13_LENGTH                0x00000001

#define _CNSTATH_w_POSITION                      0x00000000
#define _CNSTATH_w_MASK                          0xFFFFFFFF
#define _CNSTATH_w_LENGTH                        0x00000020

