is1200-example-projects/mcb32tools/headers/proc/p32mz2048ecm124.h
#define _C1INT_IVRIE_POSITION                    0x0000001F
#define _C1INT_IVRIE_MASK                        0x80000000
#define _C1INT_IVRIE_LENGTH                      0x00000001

#define _C1INT_w_POSITION                        0x00000000
#define _C1INT_w_MASK                            0xFFFFFFFF
#define _C1INT_w_LENGTH                          0x00000020

#define _C1VEC_ICODE_POSITION                    0x00000000
#define _C1VEC_ICODE_MASK                        0x0000007F
#define _C1VEC_ICODE_LENGTH                      0x00000007

#define _C1VEC_FILHIT_POSITION                   0x00000008
#define _C1VEC_FILHIT_MASK                       0x00001F00
#define _C1VEC_FILHIT_LENGTH                     0x00000005

#define _C1VEC_w_POSITION                        0x00000000
#define _C1VEC_w_MASK                            0xFFFFFFFF
#define _C1VEC_w_LENGTH                          0x00000020

#define _C1TREC_RERRCNT_POSITION                 0x00000000
#define _C1TREC_RERRCNT_MASK                     0x000000FF
#define _C1TREC_RERRCNT_LENGTH                   0x00000008

#define _C1TREC_TERRCNT_POSITION                 0x00000008
#define _C1TREC_TERRCNT_MASK                     0x0000FF00
#define _C1TREC_TERRCNT_LENGTH                   0x00000008

#define _C1TREC_EWARN_POSITION                   0x00000010
#define _C1TREC_EWARN_MASK                       0x00010000
#define _C1TREC_EWARN_LENGTH                     0x00000001

#define _C1TREC_RXWARN_POSITION                  0x00000011
#define _C1TREC_RXWARN_MASK                      0x00020000
#define _C1TREC_RXWARN_LENGTH                    0x00000001

#define _C1TREC_TXWARN_POSITION                  0x00000012
#define _C1TREC_TXWARN_MASK                      0x00040000
#define _C1TREC_TXWARN_LENGTH                    0x00000001

#define _C1TREC_RXBP_POSITION                    0x00000013
#define _C1TREC_RXBP_MASK                        0x00080000
#define _C1TREC_RXBP_LENGTH                      0x00000001

#define _C1TREC_TXBP_POSITION                    0x00000014
#define _C1TREC_TXBP_MASK                        0x00100000
#define _C1TREC_TXBP_LENGTH                      0x00000001

#define _C1TREC_TXBO_POSITION                    0x00000015
#define _C1TREC_TXBO_MASK                        0x00200000
#define _C1TREC_TXBO_LENGTH                      0x00000001

#define _C1TREC_w_POSITION                       0x00000000
#define _C1TREC_w_MASK                           0xFFFFFFFF
#define _C1TREC_w_LENGTH                         0x00000020

#define _C1FSTAT_FIFOIP_POSITION                 0x00000000
#define _C1FSTAT_FIFOIP_MASK                     0xFFFFFFFF
#define _C1FSTAT_FIFOIP_LENGTH                   0x00000020

#define _C1FSTAT_FIFOIP0_POSITION                0x00000000
#define _C1FSTAT_FIFOIP0_MASK                    0x00000001
#define _C1FSTAT_FIFOIP0_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP1_POSITION                0x00000001
#define _C1FSTAT_FIFOIP1_MASK                    0x00000002
#define _C1FSTAT_FIFOIP1_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP2_POSITION                0x00000002
#define _C1FSTAT_FIFOIP2_MASK                    0x00000004
#define _C1FSTAT_FIFOIP2_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP3_POSITION                0x00000003
#define _C1FSTAT_FIFOIP3_MASK                    0x00000008
#define _C1FSTAT_FIFOIP3_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP4_POSITION                0x00000004
#define _C1FSTAT_FIFOIP4_MASK                    0x00000010
#define _C1FSTAT_FIFOIP4_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP5_POSITION                0x00000005
#define _C1FSTAT_FIFOIP5_MASK                    0x00000020
#define _C1FSTAT_FIFOIP5_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP6_POSITION                0x00000006
#define _C1FSTAT_FIFOIP6_MASK                    0x00000040
#define _C1FSTAT_FIFOIP6_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP7_POSITION                0x00000007
#define _C1FSTAT_FIFOIP7_MASK                    0x00000080
#define _C1FSTAT_FIFOIP7_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP8_POSITION                0x00000008
#define _C1FSTAT_FIFOIP8_MASK                    0x00000100
#define _C1FSTAT_FIFOIP8_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP9_POSITION                0x00000009
#define _C1FSTAT_FIFOIP9_MASK                    0x00000200
#define _C1FSTAT_FIFOIP9_LENGTH                  0x00000001

#define _C1FSTAT_FIFOIP10_POSITION               0x0000000A
#define _C1FSTAT_FIFOIP10_MASK                   0x00000400
#define _C1FSTAT_FIFOIP10_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP11_POSITION               0x0000000B
#define _C1FSTAT_FIFOIP11_MASK                   0x00000800
#define _C1FSTAT_FIFOIP11_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP12_POSITION               0x0000000C
#define _C1FSTAT_FIFOIP12_MASK                   0x00001000
#define _C1FSTAT_FIFOIP12_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP13_POSITION               0x0000000D
#define _C1FSTAT_FIFOIP13_MASK                   0x00002000
#define _C1FSTAT_FIFOIP13_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP14_POSITION               0x0000000E
#define _C1FSTAT_FIFOIP14_MASK                   0x00004000
#define _C1FSTAT_FIFOIP14_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP15_POSITION               0x0000000F
#define _C1FSTAT_FIFOIP15_MASK                   0x00008000
#define _C1FSTAT_FIFOIP15_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP16_POSITION               0x00000010
#define _C1FSTAT_FIFOIP16_MASK                   0x00010000
#define _C1FSTAT_FIFOIP16_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP17_POSITION               0x00000011
#define _C1FSTAT_FIFOIP17_MASK                   0x00020000
#define _C1FSTAT_FIFOIP17_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP18_POSITION               0x00000012
#define _C1FSTAT_FIFOIP18_MASK                   0x00040000
#define _C1FSTAT_FIFOIP18_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP19_POSITION               0x00000013
#define _C1FSTAT_FIFOIP19_MASK                   0x00080000
#define _C1FSTAT_FIFOIP19_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP20_POSITION               0x00000014
#define _C1FSTAT_FIFOIP20_MASK                   0x00100000
#define _C1FSTAT_FIFOIP20_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP21_POSITION               0x00000015
#define _C1FSTAT_FIFOIP21_MASK                   0x00200000
#define _C1FSTAT_FIFOIP21_LENGTH                 0x00000001

#define _C1FSTAT_FIFOIP22_POSITION               0x00000016
#define _C1FSTAT_FIFOIP22_MASK                   0x00400000
#define _C1FSTAT_FIFOIP22_LENGTH                 0x00000001

